# 圆周率
pi

# 变量类型
mode(pi)

# 查看长度
length(pi)

# 取对数
log(8,2)

# 指数
exp(1)

# 组合数（从5个里面挑两个）
choose(5,2)

# 求n的阶乘
gamma(3)
factorial(3)

# 求所有元素的组合
combn()                  ######################

# 求平方根
4 * (1/2)
sqrt(4)

# 画出函数在区间[a,b]上的图像curve(f(x),[a,b])
curve()                    #333333333333333333333333333

# 行列式的计算
m1 <- matrix(c(1,2,3,4),2,2,byrow=T)
m1

# 求行列式的值
det(m1)

# 求逆矩阵
solve(m1)

# 求特征值和特征向量
eigen(m1)

################################################################################
# 1
A <- m1
det(A)
solve(A)

# 2
m <- 1
i <- 1
n <- 4
while (i <= n){
  m <- m * i
  i <- i + 1
}

# 3
B <- matrix(c(3,1,0,-4,-1,0,4,-8,-2),3,3,byrow = T)
det(B)
solve(B)
eigen(B)

# 4
X <- c(6,5,4,7,6.5,6,9,8,6,7)
Y <- c(5.1,7.2,7.3,4.5,4.6,4.9,1.0,2.9,5.0,4.8)






